In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
data = 'https://raw.githubusercontent.com/alexeygrigorev/datasets/master/course_lead_scoring.csv'

In [4]:
!wget $data

--2025-11-07 08:00:44--  https://raw.githubusercontent.com/alexeygrigorev/datasets/master/course_lead_scoring.csv
Resolving raw.githubusercontent.com (raw.githubusercontent.com)... 185.199.109.133, 185.199.108.133, 185.199.111.133, ...
Connecting to raw.githubusercontent.com (raw.githubusercontent.com)|185.199.109.133|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 80876 (79K) [text/plain]
Saving to: ‘course_lead_scoring.csv’

course_lead_scoring 100%[===================>]  78.98K  --.-KB/s    in 0.002s

2025-11-07 08:00:44 (40.7 MB/s) - ‘course_lead_scoring.csv’ saved [80876/80876]

In [5]:
df = pd.read_csv(data)
df.head()

,lead_source,industry,number_of_courses_viewed,annual_income,employment_status,location,interaction_count,lead_score,converted
0,paid_ads,NaN,1,79450.0,unemployed,south_america,4,0.94,1
1,social_media,retail,1,46992.0,employed,south_america,1,0.80,0
2,events,healthcare,5,78796.0,unemployed,australia,3,0.69,1
3,paid_ads,retail,2,83843.0,NaN,australia,1,0.87,0
4,referral,education,3,85012.0,self_employed,europe,3,0.62,1

In [6]:
df.isnull().sum()

lead_source                 128
industry                    134
number_of_courses_viewed      0
annual_income               181
employment_status           100
location                     63
interaction_count             0
lead_score                    0
converted                     0
dtype: int64

In [7]:
string_columns = list(df.dtypes[df.dtypes == 'object'].index)
string_columns

['lead_source', 'industry', 'employment_status', 'location']

In [8]:
for col in string_columns:
    df[col] = df[col].str.lower().str.replace(' ', '_')
    df[col] = df[col].str.replace('-','_')

In [9]:
df.columns

Index(['lead_source', 'industry', 'number_of_courses_viewed', 'annual_income',
       'employment_status', 'location', 'interaction_count', 'lead_score',
       'converted'],
      dtype='object')

In [10]:
df[string_columns] = df[string_columns].fillna('NA')
df[string_columns]

         lead_source       industry employment_status       location
0           paid_ads             NA        unemployed  south_america
1       social_media         retail          employed  south_america
2             events     healthcare        unemployed      australia
3           paid_ads         retail                NA      australia
4           referral      education     self_employed         europe
...              ...            ...               ...            ...
1457        referral  manufacturing     self_employed  north_america
1458        referral     technology           student         europe
1459        paid_ads     technology           student  north_america
1460        referral             NA     self_employed  north_america
1461  organic_search        finance           student  north_america

[1462 rows x 4 columns]

In [11]:
df.dtypes

lead_source                  object
industry                     object
number_of_courses_viewed      int64
annual_income               float64
employment_status            object
location                     object
interaction_count             int64
lead_score                  float64
converted                     int64
dtype: object

In [12]:
df['annual_income'] = df['annual_income'].fillna(0.0)
df['annual_income']

0       79450.0
1       46992.0
2       78796.0
3       83843.0
4       85012.0
         ...
1457        0.0
1458    65259.0
1459    45688.0
1460    71016.0
1461    92855.0
Name: annual_income, Length: 1462, dtype: float64

In [13]:
df.head()

,lead_source,industry,number_of_courses_viewed,annual_income,employment_status,location,interaction_count,lead_score,converted
0,paid_ads,NA,1,79450.0,unemployed,south_america,4,0.94,1
1,social_media,retail,1,46992.0,employed,south_america,1,0.80,0
2,events,healthcare,5,78796.0,unemployed,australia,3,0.69,1
3,paid_ads,retail,2,83843.0,NA,australia,1,0.87,0
4,referral,education,3,85012.0,self_employed,europe,3,0.62,1

In [14]:
df['industry'].value_counts()

industry
retail           203
finance          200
other            198
healthcare       187
education        187
technology       179
manufacturing    174
NA               134
Name: count, dtype: int64

In [15]:
num_columns = df[['number_of_courses_viewed', 'annual_income', 'interaction_count', 'lead_score']]
num_columns

      number_of_courses_viewed  annual_income  interaction_count  lead_score
0                            1        79450.0                  4        0.94
1                            1        46992.0                  1        0.80
2                            5        78796.0                  3        0.69
3                            2        83843.0                  1        0.87
4                            3        85012.0                  3        0.62
...                        ...            ...                ...         ...
1457                         1            0.0                  4        0.53
1458                         3        65259.0                  2        0.24
1459                         1        45688.0                  3        0.02
1460                         5        71016.0                  0        0.25
1461                         3        92855.0                  3        0.41

[1462 rows x 4 columns]

In [16]:
cre = df[['interaction_count', 'lead_score']].corr()
cre

                   interaction_count  lead_score
interaction_count           1.000000    0.009888
lead_score                  0.009888    1.000000

In [17]:
cro = df[['number_of_courses_viewed', 'lead_score']].corr()
cro

                          number_of_courses_viewed  lead_score
number_of_courses_viewed                  1.000000   -0.004879
lead_score                               -0.004879    1.000000

In [18]:
cri = df[['number_of_courses_viewed', 'interaction_count']].corr()
cri

                          number_of_courses_viewed  interaction_count
number_of_courses_viewed                  1.000000          -0.023565
interaction_count                        -0.023565           1.000000

In [19]:
cru = df[['annual_income', 'interaction_count']].corr()
cru

                   annual_income  interaction_count
annual_income           1.000000           0.027036
interaction_count       0.027036           1.000000

Annual income and interaction count have the highest correlation

In [24]:
#import scikit learn to set up validation framework
from sklearn.model_selection import train_test_split

In [69]:
#spliting the full data set into training and testing set
df_train_full, df_test = train_test_split(df, test_size=0.2, random_state=42)

In [70]:
#splitting the training dataset into training and validation sets
df_train, df_val = train_test_split(df_train_full, test_size=0.25, random_state=42)

In [71]:
df_train

,lead_source,industry,number_of_courses_viewed,annual_income,employment_status,location,interaction_count,lead_score,converted
1077,paid_ads,retail,0,58472.0,student,middle_east,5,0.03,0
463,organic_search,manufacturing,3,71738.0,student,middle_east,6,0.77,1
842,paid_ads,technology,3,81973.0,employed,north_america,2,0.59,1
835,NA,technology,1,74956.0,employed,europe,3,0.34,1
837,organic_search,retail,3,59335.0,student,australia,1,0.98,1
...,...,...,...,...,...,...,...,...,...
725,organic_search,other,1,43907.0,employed,australia,4,0.33,1
401,social_media,retail,3,64969.0,employed,north_america,1,0.18,0
957,NA,education,3,89042.0,employed,asia,4,0.75,1
992,social_media,manufacturing,1,0.0,self_employed,europe,1,0.65,0
1267,events,finance,4,50259.0,student,asia,3,0.54,1

In [52]:
#creating categorical columns group
categorical = df_train[['lead_source', 'industry', 'employment_status', 'location']]
categorical

         lead_source       industry employment_status       location
1077        paid_ads         retail           student    middle_east
463   organic_search  manufacturing           student    middle_east
842         paid_ads     technology          employed  north_america
835               NA     technology          employed         europe
837   organic_search         retail           student      australia
...              ...            ...               ...            ...
725   organic_search          other          employed      australia
401     social_media         retail          employed  north_america
957               NA      education          employed           asia
992     social_media  manufacturing     self_employed         europe
1267          events        finance           student           asia

[876 rows x 4 columns]

In [49]:
from sklearn.metrics import mutual_info_score

In [73]:
#calculating the mutual information between converted column and other categorical columns
#wrapping mutal information method into one function
def calculate_mi(series):
    return mutual_info_score(series, df_train.converted)

#Applying the function to all categorical columns
df_mi = categorical.apply(calculate_mi)
df_mi.sort_values(ascending=False).round(2)

lead_source          0.04
employment_status    0.01
industry             0.01
location             0.00
dtype: float64

The categorical column with the highest importance is lead_source

In [75]:
#deleting the converted columns in the train, test and validation dataset
del df_train['converted']
del df_val['converted']
del df_test['converted']